xjc666-666/oh-my-skill/mspm0g3519/skeleton/empty/Source/ti/motor_control_pmsm_foc/sensorless_modules/hal/LP_MSPM0Gx5xx/controllerInterface/source/focHALInterface.c
    DL_Timer_setCCPOutputDisabledAdv(FOC_PWMA0_INST,(
        DL_TIMER_CCP0_DIS_OUT_ADV_SET_BY_OCTL | 
        DL_TIMER_CCP1_DIS_OUT_ADV_SET_BY_OCTL |
        DL_TIMER_CCP2_DIS_OUT_ADV_SET_BY_OCTL | 
        DL_TIMER_CCP3_DIS_OUT_ADV_SET_BY_OCTL
        ));
}

void HAL_DisablePWM(void)
{
    /* sets the CC outputs low */
    DL_Timer_setCCPOutputDisabledAdv(FOC_PWMA0_INST,(
        DL_TIMER_CCP0_DIS_OUT_ADV_FORCE_LOW | 
        DL_TIMER_CCP1_DIS_OUT_ADV_FORCE_LOW |
        DL_TIMER_CCP2_DIS_OUT_ADV_FORCE_LOW | 
        DL_TIMER_CCP3_DIS_OUT_ADV_FORCE_LOW
        ));

    /* sets forced PWM generation to disabled */
    HAL_TimerOverRideCCPOut(FOC_PWMA0_INST, DL_TIMER_FORCE_OUT_DISABLED,
                    DL_TIMER_FORCE_CMPL_OUT_DISABLED, FOC_PWMA0_U_IDX);
    HAL_TimerOverRideCCPOut(FOC_PWMA0_INST, DL_TIMER_FORCE_OUT_DISABLED,
                    DL_TIMER_FORCE_CMPL_OUT_DISABLED, FOC_PWMA0_V_IDX);
    HAL_TimerOverRideCCPOut(FOC_PWMA0_INST, DL_TIMER_FORCE_OUT_DISABLED,
                    DL_TIMER_FORCE_CMPL_OUT_DISABLED, FOC_PWMA0_W_IDX);

#ifdef __CURRENT_SINGLE_SHUNT
    /* Set ADC Trigger to be at cc value of 0 */
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, (DL_Timer_getLoadValue(FOC_TIMA1_INST)>>1), FOC_ADC_TRIG_1_IDX);
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, 0, FOC_ADC_TRIG_0_IDX);
#endif
}

void HAL_EnableLowSideBrake(void)
{
    HAL_TimerOverRideCCPOut(FOC_PWMA0_INST, DL_TIMER_FORCE_OUT_LOW,
                            DL_TIMER_FORCE_CMPL_OUT_HIGH, FOC_PWMA0_U_IDX);
    HAL_TimerOverRideCCPOut(FOC_PWMA0_INST, DL_TIMER_FORCE_OUT_LOW,
                            DL_TIMER_FORCE_CMPL_OUT_HIGH, FOC_PWMA0_V_IDX);
    HAL_TimerOverRideCCPOut(FOC_PWMA0_INST, DL_TIMER_FORCE_OUT_LOW,
                            DL_TIMER_FORCE_CMPL_OUT_HIGH, FOC_PWMA0_W_IDX);
}

#ifndef __CURRENT_SINGLE_SHUNT

/**
 * @brief     Set PWM dutycycles for three shunt or two shunts
 * @param[in] pABC      Pointer to dutycycle
 * @param[in] FullDuty   Full dutycycle
 */
__STATIC_INLINE void HAL_UpdateDuty_3S(const MC_ABC_T *pABC, const int32_t FullDuty)
{
    int32_t duty1, duty2, duty3;
    _Bool pwmULow = false,pwmVLow = false,pwmWLow = false;

    /* Full Duty == 100% */
    duty1 = _IQmpy_mathacl(pABC->a, FullDuty);
    duty2 = _IQmpy_mathacl(pABC->b, FullDuty);
    duty3 = _IQmpy_mathacl(pABC->c, FullDuty);

    if(duty1 < DISCONTINUOUS_MIN_DUTY_COUNTS)
    {
        pwmULow = true;
    }
    else
    {
        /* Disable Force PWM for U phase */
        HAL_PWMForceDisable(FOC_PWMA0_U_IDX);

        /* duty divided by 2 for up-down counter mode */
        DL_TimerA_setCaptureCompareValue(
                          FOC_PWMA0_INST, duty1>>1, FOC_PWMA0_U_IDX);
    }

    if(duty2 < DISCONTINUOUS_MIN_DUTY_COUNTS)
    {
        pwmVLow = true;
    }
    else
    {
        /* Disable Force PWM for V phase */
        HAL_PWMForceDisable(FOC_PWMA0_V_IDX);

        /* duty divided by 2 for up-down counter mode */
        DL_TimerA_setCaptureCompareValue(
                          FOC_PWMA0_INST, duty2>>1, FOC_PWMA0_V_IDX);
    }

    if(duty3 < DISCONTINUOUS_MIN_DUTY_COUNTS)
    {
        pwmWLow = true;
    }
    else
    {
        /* Disable Force PWM for W phase */
        HAL_PWMForceDisable(FOC_PWMA0_W_IDX);

        /* duty divided by 2 for up-down counter mode */
        DL_TimerA_setCaptureCompareValue(
                          FOC_PWMA0_INST, duty3>>1, FOC_PWMA0_W_IDX);
    }

    if(pwmULow)
    {
        HAL_PWMForceLow(FOC_PWMA0_U_IDX);
    }

    if(pwmVLow)
    {
        HAL_PWMForceLow(FOC_PWMA0_V_IDX);
    }

    if(pwmWLow)
    {
        HAL_PWMForceLow(FOC_PWMA0_W_IDX);
    }
}
#endif

#ifdef __CURRENT_SINGLE_SHUNT

/**
 * @brief     Set PWM dutycycles for single shunt
 * @param[in] pABC      Pointer to dutycycle
 * @param[in] FullDuty   Full dutycycle
 * @param[in] voltageSector   Voltage sector
 * @param[in] minDelta   minimum PWM delta
 * @param[in] blankingTime   Blanking time
 */
__STATIC_INLINE void HAL_UpdateDuty_1S(const MC_ABC_T *pABC, const int32_t FullDuty,
                                                 MC_SECTOR_TYPES voltageSector,
                                                 int32_t minDelta,
                                                 int32_t blankingTime)
{
    int32_t dutyA, dutyB, dutyC;
    int32_t AcmpA, AcmpB;
    int32_t BcmpA, BcmpB;
    int32_t CcmpA, CcmpB;
    int16_t delta;
    int32_t pwm3cmpA,pwm3cmpB;

    /* Full Duty == 100% */
    dutyA = _IQmpy_mathacl(pABC->a, FullDuty);
    dutyB = _IQmpy_mathacl(pABC->b, FullDuty);
    dutyC = _IQmpy_mathacl(pABC->c, FullDuty);

    AcmpB = (dutyA>>1);
    AcmpA = FullDuty - AcmpB;
    BcmpB = (dutyB>>1);
    BcmpA = FullDuty - BcmpB;
    CcmpB = (dutyC>>1);
    CcmpA = FullDuty - CcmpB;

    switch(voltageSector)
    {
    case SECTOR_1:
            /* Max A, Min C */

            /* Mid Duty Phase Compensation */
            if(BcmpB < minDelta)
            {
                delta = minDelta - BcmpB;
                BcmpA+=delta;
                BcmpB+=delta;
            }
            /* Min Duty Phase Compensation */
            if((BcmpB - CcmpB) < minDelta)
            {
                delta = minDelta - (BcmpB - CcmpB);
                CcmpA-=delta;
                CcmpB-=delta;
            }
            /* Max Duty Phase Compensation */
            if((AcmpB - BcmpB) < minDelta)
            {
                delta = minDelta - (AcmpB - BcmpB);
                AcmpA+=delta;
                AcmpB+=delta;
            }

            /* Max Duty Phase */
            pwm3cmpA = AcmpB;
            /* Mid Duty Phase */
            pwm3cmpB = BcmpB;
            break;
        case SECTOR_2:
            /* Max B, Min C */

            /* Mid Duty Phase Compensation */
            if(AcmpB < minDelta)
            {
                delta = minDelta - AcmpB;
                AcmpA+=delta;
                AcmpB+=delta;
            }
            /* Min Duty Phase Compensation */
            if((AcmpB - CcmpB) < minDelta)
            {
                delta = minDelta - (AcmpB - CcmpB);
                CcmpA-=delta;
                CcmpB-=delta;
            }
            /* Max Duty Phase Compensation */
            if((BcmpB - AcmpB) < minDelta)
            {
                delta = minDelta - (BcmpB - AcmpB);
                BcmpA+=delta;
                BcmpB+=delta;
            }

            /* Max Duty Phase */
            pwm3cmpA = BcmpB;
            /* Mid Duty Phase */
            pwm3cmpB = AcmpB;
            break;
        case SECTOR_3:
            /* Max B, Min A */

            /* Mid Duty Phase Compensation */
            if(CcmpB < minDelta)
            {
                delta = minDelta - CcmpB;
                CcmpA+=delta;
                CcmpB+=delta;
            }
            /* Min Duty Phase Compensation */
            if((CcmpB - AcmpB) < minDelta)
            {
                delta = minDelta - (CcmpB - AcmpB);
                AcmpA-=delta;
                AcmpB-=delta;
            }
            /* Max Duty Phase Compensation */
            if((BcmpB - CcmpB) < minDelta)
            {
                delta = minDelta - (BcmpB - CcmpB);
                BcmpA+=delta;
                BcmpB+=delta;
            }

            /* Max Duty Phase */
            pwm3cmpA = BcmpB;
            /* Mid Duty Phase */
            pwm3cmpB = CcmpB;
            break;
        case SECTOR_4:
            /* Max C, Min A */

            /* Mid Duty Phase Compensation */
            if(BcmpB < minDelta)
            {
                delta = minDelta - BcmpB;
                BcmpA+=delta;
                BcmpB+=delta;
            }
            /* Min Duty Phase Compensation */
            if((BcmpB - AcmpB) < minDelta)
            {
                delta = minDelta - (BcmpB - AcmpB);
                AcmpA-=delta;
                AcmpB-=delta;
            }
            /* Max Duty Phase Compensation */
            if((CcmpB - BcmpB) < minDelta)
            {
                delta = minDelta - (CcmpB - BcmpB);
                CcmpA+=delta;
                CcmpB+=delta;
            }

            /* Max Duty Phase */
            pwm3cmpA = CcmpB;
            /* Mid Duty Phase */
            pwm3cmpB = BcmpB;
            break;
        case SECTOR_5:
            /* Max C, Min B */

            /* Mid Duty Phase Compensation */
            if(AcmpB < minDelta)
            {
                delta = minDelta - AcmpB;
                AcmpA+=delta;
                AcmpB+=delta;
            }
            /* Min Duty Phase Compensation */
            if((AcmpB - BcmpB) < minDelta)
            {
                delta = minDelta - (AcmpB - BcmpB);
                BcmpA-=delta;
                BcmpB-=delta;
            }
            /* Max Duty Phase Compensation */
            if((CcmpB - AcmpB) < minDelta)
            {
                delta = minDelta - (CcmpB - AcmpB);
                CcmpA+=delta;
                CcmpB+=delta;
            }

            /* Max Duty Phase */
            pwm3cmpA = CcmpB;
            /* Mid Duty Phase */
            pwm3cmpB = AcmpB;
            break;
        case SECTOR_6:
            /* Max A, Min B */

            /* Mid Duty Phase Compensation */
            if(CcmpB < minDelta)
            {
                delta = minDelta - CcmpB;
                CcmpA+=delta;
                CcmpB+=delta;
            }
            /* Min Duty Phase Compensation */
            if((CcmpB - BcmpB) < minDelta)
            {
                delta = minDelta - (CcmpB - BcmpB);
                BcmpA-=delta;
                BcmpB-=delta;
            }
            /* Max Duty Phase Compensation */
            if((AcmpB - CcmpB) < minDelta)
            {
                delta = minDelta - (AcmpB - CcmpB);
                AcmpA+=delta;
                AcmpB+=delta;
            }

            /* Max Duty Phase */
            pwm3cmpA = AcmpB;
            /* Mid Duty Phase */
            pwm3cmpB = CcmpB;
            break;
        default:
            pwm3cmpA = 400;
            pwm3cmpB = 200;
            break;
    }

    /* Limit cmpA */
    if(AcmpA >= FullDuty)
    {
        AcmpA = FullDuty - 1;
    }
    if(BcmpA >= FullDuty)
    {
        BcmpA = FullDuty - 1;
    }
    if(CcmpA >= FullDuty)
    {
        CcmpA = FullDuty - 1;
    }

    /* Limit cmpB */
    if(AcmpB <= 0)
    {
        AcmpB = 1;
    }
    if(BcmpB <= 0)
    {
        BcmpB = 1;
    }
    if(CcmpB <= 0)
    {
        CcmpB = 1;
    }

    HAL_setCaptureCompareValue(
                    FOC_PWMA0_INST, AcmpA, FOC_PWMA0_U_IDX);
    HAL_setCaptureCompareValue(
                    FOC_PWMA0_INST, AcmpB, FOC_PWMA0_U_B_IDX);

    /* Disable Force PWM for U phase */
//    HAL_PWMForceDisable(FOC_PWMA0_U_IDX);
    

    HAL_setCaptureCompareValue(
                    FOC_PWMA0_INST, BcmpA, FOC_PWMA0_V_IDX);
    HAL_setCaptureCompareValue(
                    FOC_PWMA0_INST, BcmpB, FOC_PWMA0_V_B_IDX);
                    
    /* Disable Force PWM for V phase */
//    HAL_PWMForceDisable(FOC_PWMA0_V_IDX);
    

    HAL_setCaptureCompareValue(
                    FOC_PWMA0_INST, CcmpA, FOC_PWMA0_W_IDX);
    HAL_setCaptureCompareValue(
                    FOC_PWMA0_INST, CcmpB, FOC_PWMA0_W_B_IDX);

