xjc666-666/oh-my-skill/mspm0g3519/skeleton/empty/Source/ti/motor_control_pmsm_foc/sensorless_modules/hal/LP_MSPM0Gx5xx/controllerInterface/source/focHALInterface.c
    /* Disable Force PWM for W phase */
//    HAL_PWMForceDisable(FOC_PWMA0_W_IDX);

    pwm3cmpA = pwm3cmpA - blankingTime;
    pwm3cmpB = pwm3cmpB - blankingTime;
    if(pwm3cmpA<=0)
    {
        pwm3cmpA = 1;
    }
    if(pwm3cmpB<=0)
    {
        pwm3cmpB = 1;
    }

    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, pwm3cmpA, FOC_ADC_TRIG_1_IDX);
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, pwm3cmpB, FOC_ADC_TRIG_0_IDX);

}

#endif

void HAL_UpdateDuty(const MC_ABC_T *pABC, const int32_t FullDuty,
                                                 MC_SECTOR_TYPES voltageSector,
                                                 int32_t minDelta,
                                                 int32_t blankingTime)
{
    #ifdef __CURRENT_SINGLE_SHUNT
        HAL_UpdateDuty_1S( pABC, FullDuty, 
                            voltageSector, minDelta, blankingTime);
    #else
        HAL_UpdateDuty_3S(pABC, FullDuty);

    #endif
}

void HAL_SetPWMFrequency(const int32_t pwmPeriod,
                         const int32_t propagationDelay)
{
    
#ifndef __CURRENT_SINGLE_SHUNT

    uint32_t triggerPoint;

    /* period is divided by 2 for up-down counter mode */
    DL_Timer_setLoadValue(FOC_PWMA0_INST, pwmPeriod >> 1);

    /* Set 3 shunt adc trigger point */
    /* period is divided by 2 for up-down counter mode */
    HAL_setCaptureCompareValue(
        FOC_PWMA0_INST, ((pwmPeriod >> 1) - _IQabs(propagationDelay)),
        FOC_PWMA0_ADC_TRIG_IDX);

    if(propagationDelay > 0)
    {
        /* Trigger after the Counter Load */
        triggerPoint = FOC_PWMA0_ADC_TRIG_DN_EVENT;
    }
    else if(propagationDelay < 0)
    {
        /* Trigger before the Counter Load */
        triggerPoint = FOC_PWMA0_ADC_TRIG_UP_EVENT;
    }
    else
    {
        /* Trigger at the Counter Load */
        triggerPoint = FOC_PWMA0_ADC_TRIG_LOAD_EVENT;
    }

    /* Disable all trigger points */
    DL_TimerA_disableEvent(FOC_PWMA0_INST, DL_TIMERA_EVENT_ROUTE_1,
            0xFFFF);

    /* Generate Trigger for ADC Conversion on PWMA0 at Trigger Point */
    DL_TimerA_enableEvent(FOC_PWMA0_INST, DL_TIMERA_EVENT_ROUTE_1,
                        triggerPoint);
    DL_TimerA_setPublisherChanID(FOC_PWMA0_INST, DL_TIMERA_PUBLISHER_INDEX_0,
                        ADC_PWM_TRIG_CH);

#else
    DL_Timer_setLoadValue(FOC_PWMA0_INST, pwmPeriod);
    DL_Timer_setLoadValue(FOC_TIMA1_INST, pwmPeriod);
    
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST,  (DL_Timer_getLoadValue(FOC_TIMA1_INST)>>1), FOC_ADC_TRIG_1_IDX);
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, 0, FOC_ADC_TRIG_0_IDX);
#endif
}


void HAL_enterIPDMode()
{
    /* Stop the 1ms ISR */
    DL_Timer_stopCounter(FOC_TIMG0_INST);

    /* Disable the ADC interrupt */
    DL_ADC12_disableInterrupt(FOC_ADC_ISR_INST, 1<<(FOC_ADC_MEM_RES_LOAD-1));
    HAL_SetADCSamplingFrequency(ADC_SAMPLE_EVERY_PWM);

}

void HAL_exitIPDMode()
{
    /* Disable the trigger */
    DL_Timer_configCrossTriggerInputCond(FOC_PWMA0_INST, DL_TIMER_CROSS_TRIGGER_INPUT_DISABLED);
    HAL_disableTriggerFault(FOC_PWMA0_INST);

    /* Clear the timer fault */
    HAL_clearFaultStatus();
    
    /* Start the 1ms timer */
    DL_Timer_startCounter(FOC_TIMG0_INST);

    /* Reset the Timer A0 , Timer A1
     * -> Stop the Timers
     * - > Reset the Counters
     * Start the timers with cross trigger enabled*/
#ifdef __CURRENT_SINGLE_SHUNT
    DL_Timer_stopCounter(FOC_PWMA0_INST);
    DL_Timer_stopCounter(FOC_TIMA1_INST);

    DL_Timer_setTimerCount(FOC_PWMA0_INST,0);
    DL_Timer_setTimerCount(FOC_TIMA1_INST,0);
#endif
    /* reset the ADCs back to user configuration*/
#if  defined ADC0_INST
    DL_ADC12_reset(ADC0_INST);
    DL_ADC12_enablePower(ADC0_INST);
    delay_cycles(POWER_STARTUP_DELAY);
    SYSCFG_DL_ADC0_init();
#endif

#if defined ADC1_INST
    DL_ADC12_reset(ADC1_INST);
    DL_ADC12_enablePower(ADC1_INST);
    delay_cycles(POWER_STARTUP_DELAY);
    SYSCFG_DL_ADC1_init();
#endif

#ifdef __CURRENT_SINGLE_SHUNT
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, (DL_Timer_getLoadValue(FOC_TIMA1_INST)>>1), FOC_ADC_TRIG_1_IDX);
    HAL_setCaptureCompareValue(
                    FOC_TIMA1_INST, 0, FOC_ADC_TRIG_0_IDX);
#endif

    /* Run foc peripheral init */
    focPeriphInit();

    /* Enable the ADC interrupt */
    DL_ADC12_enableInterrupt(FOC_ADC_ISR_INST, 1<<(FOC_ADC_MEM_RES_LOAD-1));

}

void HAL_SetADCSamplingFrequency(const ADC_SAMPLING_RATIO_TYPES samplingRatio)
{
#ifndef __CURRENT_SINGLE_SHUNT
    DL_TimerA_setRepeatCounter(FOC_PWMA0_INST, samplingRatio);
   DL_ADC12_setSubscriberChanID(FOC_ADC0_INST, ADC_PWM_TRIG_CH);
   DL_ADC12_setSubscriberChanID(FOC_ADC1_INST, ADC_PWM_TRIG_CH);
#else
    DL_TimerA_setRepeatCounter(FOC_PWMA0_INST, samplingRatio);
    DL_TimerA_setRepeatCounter(FOC_TIMA1_INST, samplingRatio);
#endif
}

void HAL_SetSystemFrequency(const int32_t systemPeriod)
{
    DL_Timer_setLoadValue(FOC_TIMER_INST, systemPeriod);
}

_Bool HAL_GetPhasesFloatingStatus(const HAL_MEASURE_VOLTAGE_T *pVoltage)
{
    _Bool status, vaMid, vbMid, vcMid;

    MC_ABC_T Vabc = pVoltage->vabcRaw;

    int32_t lowLimit, highLimit;

    lowLimit = _IQmpy_mathacl(pVoltage->vdc, _IQ(MIN_FLOAT_VOLTAGE));
    highLimit = _IQmpy_mathacl(pVoltage->vdc, _IQ(MAX_FLOAT_VOLTAGE));

    vaMid = (Vabc.a >= lowLimit) && (Vabc.a < highLimit);
    vbMid = (Vabc.b >= lowLimit) && (Vabc.b < highLimit);
    vcMid = (Vabc.c >= lowLimit) && (Vabc.c < highLimit);

    if(((vaMid && vbMid) ||
        (vbMid && vcMid) ||
        (vcMid && vaMid)) ||
        (Vabc.a <= lowLimit && Vabc.b <= lowLimit && Vabc.c <= lowLimit) ||
        (Vabc.a >= highLimit && Vabc.b >= highLimit && Vabc.c >= highLimit))

    {
        /* All three phase voltages are either pulled up, down or in between
         * If current flows through phases, at least one phase voltage will be
         * pulled up, other will be pulled down (+ve curr, -ve curr) */
        status = TRUE;
    }
    else
    {
        status = FALSE;
    }

