xjc666-666/oh-my-skill/mspm0g3519/skeleton/empty/Source/ti/motor_control_pmsm_foc/sensorless_modules/hal/LP_MSPM0Gx5xx/controllerInterface/source/focHALInterface.c
    return status;
}


void HAL_ClearNFault()
{
    DL_GPIO_clearPins(FOC_GPIO_NFAULT_PORT, FOC_GPIO_NFAULT_PIN);
}

void HAL_SetNFault()
{
    DL_GPIO_setPins(FOC_GPIO_NFAULT_PORT, FOC_GPIO_NFAULT_PIN);
}

uint32_t HAL_getRawHVdieFaultStatus(void)
{
    return (DL_Timer_getRawInterruptStatus(FOC_PWMA0_INST,
                                                GPTIMER_CPU_INT_IMASK_F_MASK));
}

uint32_t HAL_getRawFaultStatus(void)
{
    return (DL_Timer_getRawInterruptStatus(FOC_PWMA0_INST,
                                                GPTIMER_CPU_INT_IMASK_F_MASK));
}

void HAL_clearFaultStatus(void)
{
    DL_Timer_clearInterruptStatus(FOC_PWMA0_INST, GPTIMER_CPU_INT_IMASK_F_MASK);
}

void HAL_setGateDriveOffsetCalib(void)
{
    gateDriverOffsetCalibSet();
}

void HAL_resetGateDriveOffsetCalib(void)
{
    gateDriverOffsetCalibReset();
}

void HAL_pwmCountZero(void)
{
    HAL_setCaptureCompareValue(
                        FOC_PWMA0_INST, 0, FOC_PWMA0_U_IDX);
    HAL_setCaptureCompareValue(
                        FOC_PWMA0_INST, 0, FOC_PWMA0_V_IDX);
    HAL_setCaptureCompareValue(
                        FOC_PWMA0_INST, 0, FOC_PWMA0_W_IDX);

    #ifdef __CURRENT_SINGLE_SHUNT
    HAL_setCaptureCompareValue(
                        FOC_PWMA0_INST, 0, FOC_PWMA0_U_B_IDX);
    HAL_setCaptureCompareValue(
                        FOC_PWMA0_INST, 0, FOC_PWMA0_V_B_IDX);
    HAL_setCaptureCompareValue(
                        FOC_PWMA0_INST, 0, FOC_PWMA0_W_B_IDX);

    #endif
}

void HAL_delayMicroSeconds(uint32_t num_us)
{
    if(num_us == 0)
    {
        return;
    }
    DL_Common_delayCycles(num_us*HAL_CYCLES_TO_1_US_DELAY);
}

void HAL_DisableINT(void)
{
    __disable_irq();
}

void HAL_resetPOR(void)
{
    DL_SYSCTL_resetDevice(DL_SYSCTL_RESET_POR);
}

_Bool HAL_getDirPinStatus(void)
{
    return DL_GPIO_readPins(FOC_GPIO_DIR_PORT, FOC_GPIO_DIR_PIN)?
                        HAL_GPIO_HIGH : HAL_GPIO_LOW;
}

_Bool HAL_getBrakePinStatus(void)
{
    return DL_GPIO_readPins(FOC_GPIO_BRAKE_PORT, FOC_GPIO_BRAKE_PIN)?
                        HAL_GPIO_HIGH : HAL_GPIO_LOW;
}

static const DL_ADC12_ClockConfig gADC_IPDClockConfig = {
    .clockSel       = DL_ADC12_CLOCK_ULPCLK,
    .divideRatio    = DL_ADC12_CLOCK_DIVIDE_1,
    .freqRange      = DL_ADC12_CLOCK_FREQ_RANGE_32_TO_40,
};

static void IPD_ADC_init(ADC12_Regs *adc12Inst, uint32_t chansel)
{
    DL_ADC12_setClockConfig(adc12Inst, (DL_ADC12_ClockConfig *) &gADC_IPDClockConfig);
    DL_ADC12_initSingleSample(adc12Inst,
        DL_ADC12_REPEAT_MODE_ENABLED, DL_ADC12_SAMPLING_SOURCE_AUTO, DL_ADC12_TRIG_SRC_SOFTWARE,
        DL_ADC12_SAMP_CONV_RES_12_BIT, DL_ADC12_SAMP_CONV_DATA_FORMAT_UNSIGNED);
    DL_ADC12_configConversionMem(adc12Inst, DL_ADC12_MEM_IDX_0,
        chansel, DL_ADC12_REFERENCE_VOLTAGE_VDDA, DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP0, DL_ADC12_AVERAGING_MODE_DISABLED,
        DL_ADC12_BURN_OUT_SOURCE_DISABLED, DL_ADC12_TRIGGER_MODE_AUTO_NEXT, DL_ADC12_WINDOWS_COMP_MODE_ENABLED);
    DL_ADC12_setPowerDownMode(adc12Inst,DL_ADC12_POWER_DOWN_MODE_MANUAL);
    DL_ADC12_setSampleTime0(adc12Inst,2);
    DL_ADC12_setPublisherChanID(adc12Inst,FOC_IPD_EVENT_CH);
#ifdef _NONINVERT_ISEN
    DL_ADC12_enableEvent(adc12Inst,DL_ADC12_EVENT_WINDOW_COMP_HIGH);
#else
    DL_ADC12_enableEvent(adc12Inst,DL_ADC12_EVENT_WINDOW_COMP_LOW);
#endif
    DL_ADC12_enableConversions(adc12Inst);
}

#ifdef __CURRENT_SINGLE_SHUNT
/**
 * @brief     Set IPD Pulse configuration
 * @param[in] vector voltage vector to set
 * @param[in] CompVal Comparator threshold value
 * @param[in] pOffset ADC offset pointer
 */
__STATIC_INLINE void HAL_setIPDPulseConfig_1S(VOLTAGE_VECTOR vector, uint8_t CompVal, CURRENT_OFFSET_T* pOffset)
{
    #ifdef __IPD_ENABLE
    int16_t WCompTh;
    
    /* setting minimum compare value to 2 */
    if(CompVal <= 2)
    {
        CompVal = 2;
    }
    
    /* Convert 8 bit to 12 bit adc range*/
    WCompTh = ((uint16_t)CompVal)<<4;

    /* Stop the ADCs */
    HAL_ADCDisConv(ADC0_INST);
    HAL_ADCDisConv(ADC1_INST);
    
    DL_ADC12_reset(ADC0_INST);
    DL_ADC12_reset(ADC1_INST);
    DL_ADC12_enablePower(ADC0_INST);
    DL_ADC12_enablePower(ADC1_INST);
    delay_cycles(POWER_STARTUP_DELAY);

    /* set the publisher channels to disabled and clear all events */
    DL_ADC12_setPublisherChanID(ADC0_INST,0);
    DL_ADC12_setPublisherChanID(ADC1_INST,0);

    DL_Timer_stopCounter(FOC_CAPTURE_IPD_INST);
    /* clear Capture interrupt status */
    DL_Timer_clearInterruptStatus(FOC_CAPTURE_IPD_INST, 
                DL_TIMER_INTERRUPT_CC0_DN_EVENT|DL_TIMER_INTERRUPT_ZERO_EVENT);
    /* clear the Fault interrupt */
    HAL_clearFaultStatus();

    /* Set timer A0 to trigger using event configuration */
    /*
    CTTRIGCTL.CTEN=1 ,DL_TIMER_CROSS_TRIGGER_MODE_ENABLED
    CTTRIGCTL.EVTCTEN=1 ,DL_TIMER_CROSS_TRIGGER_INPUT_ENABLED
    CTTRIGCTL.EVTCTTRIGSEL=1 ,DL_TIMER_CROSS_TRIG_SRC_FSUB0
    */
    DL_Timer_configCrossTrigger(FOC_PWMA0_INST,DL_TIMER_CROSS_TRIG_SRC_FSUB0,
    DL_TIMER_CROSS_TRIGGER_INPUT_ENABLED,DL_TIMER_CROSS_TRIGGER_MODE_ENABLED);

    /* TSEL.ETSEL =0*/
    /* TSEL.TE =1 */
    DL_Timer_setExternalTriggerEvent(FOC_PWMA0_INST,DL_TIMER_EXT_TRIG_SEL_TRIG_0);
    DL_Timer_enableExternalTrigger(FOC_PWMA0_INST);

    /* FCTL.TFIM =1 */
    HAL_enableTriggerFault(FOC_PWMA0_INST);

    IPD_ADC_init(FOC_CURR_ADC_INSTANCE, ADC_DC_CURRENT_CH);

#ifdef _NONINVERT_ISEN
    DL_ADC12_configWinCompHighThld(FOC_CURR_ADC_INSTANCE, pOffset->i2Offset +WCompTh);
#else
    DL_ADC12_configWinCompLowThld(FOC_CURR_ADC_INSTANCE, pOffset->i2Offset -WCompTh);
#endif
    DL_ADC12_startConversion(FOC_CURR_ADC_INSTANCE);/* ADC conversion started */

    switch(vector)
    {
        case VOLTAGE_VECTOR_AC:

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_V_IDX);
            HAL_PWMForceLow(FOC_PWMA0_W_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_U_IDX);
            break;
        case VOLTAGE_VECTOR_CA:

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_V_IDX);
            HAL_PWMForceLow(FOC_PWMA0_U_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_W_IDX);
            break;
        case VOLTAGE_VECTOR_BC:
            
            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_U_IDX);
            HAL_PWMForceLow(FOC_PWMA0_W_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_V_IDX);
            break;
        case VOLTAGE_VECTOR_CB:
             
            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_U_IDX);
            HAL_PWMForceLow(FOC_PWMA0_V_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_W_IDX);
            break;
        case VOLTAGE_VECTOR_BA:
        
            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_W_IDX);
            HAL_PWMForceLow(FOC_PWMA0_U_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_V_IDX);
            break;
        case VOLTAGE_VECTOR_AB:

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_W_IDX);
            HAL_PWMForceLow(FOC_PWMA0_V_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_U_IDX);
            break;
        default:
            /* This is expected to be empty */
            break;
    }

    HAL_IPDEnableISR();
    #endif
}

#else
/**
 * @brief     Set IPD Pulse configuration
 * @param[in] vector voltage vector to set
 * @param[in] CompVal Comparator threshold value
 * @param[in] pOffset ADC offset pointer
 */
__STATIC_INLINE void HAL_setIPDPulseConfig_3S(VOLTAGE_VECTOR vector, uint8_t CompVal, CURRENT_OFFSET_T* pOffset)
{
    #ifdef __IPD_ENABLE
    int16_t WCompTh;
    
    /* setting minimum compare value to 2 */
    if(CompVal <= 2)
    {
        CompVal = 2; 
    }
    
    /* Convert 8 bit to 12 bit adc range*/
    WCompTh = ((uint16_t)CompVal)<<4;

    /* Stop the ADCs */
    HAL_ADCDisConv(ADC0_INST);
    HAL_ADCDisConv(ADC1_INST);
    
    DL_ADC12_reset(ADC0_INST);
    DL_ADC12_reset(ADC1_INST);
    DL_ADC12_enablePower(ADC0_INST);
    DL_ADC12_enablePower(ADC1_INST);
    delay_cycles(POWER_STARTUP_DELAY);

    /* set the publisher channels to disabled and clear all events */
    DL_ADC12_setPublisherChanID(ADC0_INST,0);
    DL_ADC12_setPublisherChanID(ADC1_INST,0);

    DL_Timer_stopCounter(FOC_CAPTURE_IPD_INST);
    /* clear Capture interrupt status */
    DL_Timer_clearInterruptStatus(FOC_CAPTURE_IPD_INST, 
                DL_TIMER_INTERRUPT_CC0_DN_EVENT|DL_TIMER_INTERRUPT_ZERO_EVENT);
    /* clear the Fault interrupt */
    HAL_clearFaultStatus();

    /* Set timer A0 to trigger using event configuration */
    /*
    CTTRIGCTL.CTEN=1 ,DL_TIMER_CROSS_TRIGGER_MODE_ENABLED
    CTTRIGCTL.EVTCTEN=1 ,DL_TIMER_CROSS_TRIGGER_INPUT_ENABLED
    CTTRIGCTL.EVTCTTRIGSEL=1 ,DL_TIMER_CROSS_TRIG_SRC_FSUB0
    */
    DL_Timer_configCrossTrigger(FOC_PWMA0_INST,DL_TIMER_CROSS_TRIG_SRC_FSUB0,
    DL_TIMER_CROSS_TRIGGER_INPUT_ENABLED,DL_TIMER_CROSS_TRIGGER_MODE_ENABLED);

    /* TSEL.ETSEL =0*/
    /* TSEL.TE =1 */
    DL_Timer_setExternalTriggerEvent(FOC_PWMA0_INST,DL_TIMER_EXT_TRIG_SEL_TRIG_0);
    DL_Timer_enableExternalTrigger(FOC_PWMA0_INST);

    /* FCTL.TFIM =1 */
    HAL_enableTriggerFault(FOC_PWMA0_INST);

    switch(vector)
    {
        case VOLTAGE_VECTOR_AC:

#if defined ADC0_CURRENT_W_CH
            IPD_ADC_init(ADC0_INST, ADC0_CURRENT_W_CH);
            DL_ADC12_configWinCompLowThld(ADC0_INST, pOffset->icOffset -WCompTh);
            DL_ADC12_startConversion(ADC0_INST);/* ADC conversion started */
#else
            IPD_ADC_init(ADC1_INST, ADC1_CURRENT_W_CH);
            DL_ADC12_configWinCompLowThld(ADC1_INST, pOffset->icOffset -WCompTh);
            DL_ADC12_startConversion(ADC1_INST);/* ADC conversion started */
#endif

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_V_IDX);
            HAL_PWMForceLow(FOC_PWMA0_W_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_U_IDX);
            break;
        case VOLTAGE_VECTOR_CA:

#if defined ADC0_CURRENT_U_CH
            IPD_ADC_init(ADC0_INST, ADC0_CURRENT_U_CH);
            DL_ADC12_configWinCompLowThld(ADC0_INST, pOffset->iaOffset -WCompTh);
            DL_ADC12_startConversion(ADC0_INST);/* ADC conversion started */
#else
            IPD_ADC_init(ADC1_INST, ADC1_CURRENT_U_CH);
            DL_ADC12_configWinCompLowThld(ADC1_INST, pOffset->iaOffset -WCompTh);
            DL_ADC12_startConversion(ADC1_INST);/* ADC conversion started */
#endif

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_V_IDX);
            HAL_PWMForceLow(FOC_PWMA0_U_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_W_IDX);
            break;
        case VOLTAGE_VECTOR_BC:

#if defined ADC0_CURRENT_W_CH
            IPD_ADC_init(ADC0_INST, ADC0_CURRENT_W_CH);
            DL_ADC12_configWinCompLowThld(ADC0_INST, pOffset->icOffset -WCompTh);
            DL_ADC12_startConversion(ADC0_INST);/* ADC conversion started */
#else
            IPD_ADC_init(ADC1_INST, ADC1_CURRENT_W_CH);
            DL_ADC12_configWinCompLowThld(ADC1_INST, pOffset->icOffset -WCompTh);
            DL_ADC12_startConversion(ADC1_INST);/* ADC conversion started */
#endif

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_U_IDX);
            HAL_PWMForceLow(FOC_PWMA0_W_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_V_IDX);
            break;
        case VOLTAGE_VECTOR_CB:
                    
#if defined ADC0_CURRENT_V_CH
            IPD_ADC_init(ADC0_INST, ADC0_CURRENT_V_CH);
            DL_ADC12_configWinCompLowThld(ADC0_INST, pOffset->ibADC0Offset -WCompTh);
            DL_ADC12_startConversion(ADC0_INST);/* ADC conversion started */
#else
            IPD_ADC_init(ADC1_INST, ADC1_CURRENT_V_CH);
            DL_ADC12_configWinCompLowThld(ADC1_INST, pOffset->ibADC0Offset -WCompTh);
            DL_ADC12_startConversion(ADC1_INST);/* ADC conversion started */
#endif

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_U_IDX);
            HAL_PWMForceLow(FOC_PWMA0_V_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_W_IDX);
            break;
        case VOLTAGE_VECTOR_BA:
        
#if defined ADC0_CURRENT_U_CH
            IPD_ADC_init(ADC0_INST, ADC0_CURRENT_U_CH);
            DL_ADC12_configWinCompLowThld(ADC0_INST, pOffset->iaOffset -WCompTh);
            DL_ADC12_startConversion(ADC0_INST);/* ADC conversion started */
#else
            IPD_ADC_init(ADC1_INST, ADC1_CURRENT_U_CH);
            DL_ADC12_configWinCompLowThld(ADC1_INST, pOffset->iaOffset -WCompTh);
            DL_ADC12_startConversion(ADC1_INST);/* ADC conversion started */
#endif

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_W_IDX);
            HAL_PWMForceLow(FOC_PWMA0_U_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_V_IDX);
            break;
        case VOLTAGE_VECTOR_AB:

#if defined ADC0_CURRENT_V_CH
            IPD_ADC_init(ADC0_INST, ADC0_CURRENT_V_CH);
            DL_ADC12_configWinCompLowThld(ADC0_INST, pOffset->ibADC0Offset -WCompTh);
            DL_ADC12_startConversion(ADC0_INST);/* ADC conversion started */
#else
            IPD_ADC_init(ADC1_INST, ADC1_CURRENT_V_CH);
            DL_ADC12_configWinCompLowThld(ADC1_INST, pOffset->ibADC0Offset -WCompTh);
            DL_ADC12_startConversion(ADC1_INST);/* ADC conversion started */
#endif

            /* Disable PWM and Set the PWM to low */
            HAL_PWMForceDisable(FOC_PWMA0_W_IDX);
            HAL_PWMForceLow(FOC_PWMA0_V_IDX);
            /* Start the timer */
            DL_Timer_startCounter(FOC_CAPTURE_IPD_INST);
            /*Set PWM high*/
            HAL_PWMForceHigh(FOC_PWMA0_U_IDX);
            break;
        default:
            /* This is expected to be empty */
            break;
    }

    HAL_IPDEnableISR();
    #endif
}
#endif

void HAL_setIPDPulseConfig(VOLTAGE_VECTOR vector, uint8_t CompVal, CURRENT_OFFSET_T* pOffset)
{
    #ifdef __CURRENT_SINGLE_SHUNT
        HAL_setIPDPulseConfig_1S( vector, CompVal, pOffset);
    #else
        HAL_setIPDPulseConfig_3S( vector, CompVal, pOffset);
    #endif
}

void HAL_IPDEnableISR(void)
{
#ifdef __IPD_ENABLE
    NVIC_EnableIRQ(FOC_CAPTURE_IRQN);
#endif
}

void HAL_IPDDisableISR(void)
{
#ifdef __IPD_ENABLE
    NVIC_DisableIRQ(FOC_CAPTURE_IRQN);
#endif
}

uint16_t HAL_IPDGetTime(void)
{
#ifdef __IPD_ENABLE
    return DL_Timer_getCaptureCompareValue(FOC_CAPTURE_IPD_INST, FOC_CAPTURE_IPD_IDX);
#else
    return 0;
#endif
}

uint16_t HAL_IPDGetLoadVal(void)
{
#ifdef __IPD_ENABLE
    return FOC_CAPTURE_IPD_LOAD_VALUE;
#else
    return 0;
#endif
}
uint16_t HAL_Is_SingleShunt(void)
{
#ifdef __CURRENT_SINGLE_SHUNT
    return TRUE;
#else
    return FALSE;
#endif
}
